ma-hy15/nrf52832_ble_nus/main.c
void adc_config()
{
	ret_code_t err_code=NRF_SUCCESS;
	
	//ADC通道配置结构体
	nrf_saadc_channel_config_t channel_config = NRFX_SAADC_DEFAULT_CHANNEL_CONFIG_DIFFERENTIAL(NRF_SAADC_INPUT_AIN0,NRF_SAADC_INPUT_AIN1);
	nrf_saadc_channel_config_t channel_config2 = NRFX_SAADC_DEFAULT_CHANNEL_CONFIG_DIFFERENTIAL(NRF_SAADC_INPUT_AIN3,NRF_SAADC_INPUT_AIN2);
	nrf_saadc_channel_config_t channel_config3 = NRFX_SAADC_DEFAULT_CHANNEL_CONFIG_DIFFERENTIAL(NRF_SAADC_INPUT_AIN4,NRF_SAADC_INPUT_AIN5);
	nrf_saadc_channel_config_t channel_config4 = NRFX_SAADC_DEFAULT_CHANNEL_CONFIG_DIFFERENTIAL(NRF_SAADC_INPUT_AIN7,NRF_SAADC_INPUT_AIN6);
	//初始化SAADC，注册事件回调函数 
	err_code=nrf_drv_saadc_init(NULL,saadc_callback);
	APP_ERROR_CHECK(err_code);
	//初始化SAADC通道0
	err_code=nrfx_saadc_channel_init(0,&channel_config);
	APP_ERROR_CHECK(err_code);
	//初始化SAADC通道1
	err_code=nrfx_saadc_channel_init(1,&channel_config2);
	APP_ERROR_CHECK(err_code);	
		//初始化SAADC通道2
	err_code=nrfx_saadc_channel_init(2,&channel_config3);
	APP_ERROR_CHECK(err_code);	
		//初始化SAADC通道3
	err_code=nrfx_saadc_channel_init(3,&channel_config4);
	APP_ERROR_CHECK(err_code);	
	//注册双缓存
	err_code=nrfx_saadc_buffer_convert(m_buffer_pool[0],SAMPLE_BUFFER_LEN);
	APP_ERROR_CHECK(err_code);
	err_code=nrfx_saadc_buffer_convert(m_buffer_pool[1],SAMPLE_BUFFER_LEN);
	APP_ERROR_CHECK(err_code);
	
}

void ppi_config()
{
	uint32_t err_code=NRF_SUCCESS;
	
	//初始化PPI模块
	err_code=nrf_drv_ppi_init();
	APP_ERROR_CHECK(err_code);
	
	//申请PPI通道
	err_code = nrfx_ppi_channel_alloc(&my_ppi_channel);
	APP_ERROR_CHECK(err_code);
	
	//设置通道的TEP和EEP
	err_code = nrfx_ppi_channel_assign(my_ppi_channel,nrfx_timer_compare_event_address_get(&MY_TIMER,NRF_TIMER_CC_CHANNEL0),nrfx_saadc_sample_task_get());
	APP_ERROR_CHECK(err_code);
	
	//设置次级任务端点
	//err_code = nrfx_ppi_channel_fork_assign(my_ppi_channel,nrfx_gpiote_out_task_addr_get(LED_4));
	//APP_ERROR_CHECK(err_code);
	
//	//使能PPI通道
//	err_code = nrfx_ppi_channel_enable(my_ppi_channel);
//	APP_ERROR_CHECK(err_code);
	
	//PPI是硬件活动，与中断/事件回调无关！不冲突！(GPIOTE会使得回调函数里对GPIOTE端口的GPIO操作失败)
}

//WDT 中断只有2个32.768kHz的时钟周期，之后系统复位
void wdt_event_handler(void)
{
	bsp_board_leds_on();
}

void wdt_config()
{
	uint32_t err_code=NRF_SUCCESS;
	
	// 喂狗设置，默认2000ms喂一次
	nrfx_wdt_config_t config = NRFX_WDT_DEAFULT_CONFIG;
	err_code=nrfx_wdt_init(&config,wdt_event_handler);
	APP_ERROR_CHECK(err_code);
	
	// 申请喂狗通道
	err_code = nrfx_wdt_channel_alloc(&my_channel_id);
	APP_ERROR_CHECK(err_code);
	
	//开始计数，不可终止，所以该初始化函数最好最后执行
	nrfx_wdt_enable();
}
/**@brief Application main function.
 */
int main(void)
{
    bool erase_bonds;

    // Initialize.
    uart_init();
    log_init();
    timers_init();
    buttons_leds_init(&erase_bonds);
    power_management_init();
    ble_stack_init();
    gap_params_init();
    gatt_init();
    services_init();
    advertising_init();
    conn_params_init();
		
    // Start execution.
    printf("\r\nUART started.\r\n");
    NRF_LOG_INFO("Debug logging for UART over RTT started.");
    advertising_start();
		
		adc_config();
	
		timer_config();
	
		//gpiote_config();
	
		ppi_config();
		
		app_timer_config();
		wdt_config();
	
		//throughput_test();

    // Enter main loop.
    for (;;)
    {
        idle_state_handle();
    }
}


/**
 * @}
 */
